##### CSV 파일 불러오기

CSV 파일이란 Raw Data들이 쉼표(,)를 기준으로 구분되어 있는 데이터 파일이다.
Pandas에서 데이터 분석을 할 때는 보통 CSV 파일을 불러와서 DataFrame 형식으로 변환하여 사용한다.

In [1]:
import pandas as pd
# pandas라는 패키지(미리 만들어 둔 코드 뭉치)를 불러오고, pandas라고 매번 치기 귀찮으니까 pd라는 별명으로 부르기로 한다.

In [3]:
titanic_dataFrame = pd.read_csv("data/titanic.csv")
# data 폴더의 titanic.csv 파일을 DataFrame 타입으로 불러온다.
# 이 과정은 pandas 패키지의 read_csv 함수가 수행해준다.
# pd.read_csv("파일 경로")를 이용하면 위와 같이 csv 파일을 불러올 수 있다.

##### DataFrame
DateFrame 타입은 자료를 행과 열로 구분한 표와 비슷한 구조이다.
각 행은 index라는 고유한 숫자/문자열로 구분된다.
각 열은 각 행의 속성을 의미한다.

In [4]:
titanic_dataFrame
# DataFrame 타입의 변수 이름을 입력하면 DataFrame의 개괄적인 모습을 볼 수 있다.
# 아래 DataFrame에서 맨 앞의 0 ~ 1308은 index로, 각 행을 구분한다.
# pclass ~ home.dest는 각 열의 이름으로, 행들의 속성을 나타내는 역할을 한다.

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,?,C,?,328,?
1305,3,0,"Zabour, Miss. Thamine",female,?,1,0,2665,14.4542,?,C,?,?,?
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,?,C,?,304,?
1307,3,0,"Zakarian, Mr. Ortin",male,27,0,0,2670,7.225,?,C,?,?,?
1308,3,0,"Zimmerman, Mr. Leo",male,29,0,0,315082,7.875,?,S,?,?,?

In [5]:
titanic_dataFrame.info()
# DataFrame 이름.info()는 DataFrame의 정보를 확인하는 기능을 수행한다.
# RangeIndex: 존재하는 행의 개수
# Column: 각 열의 이름
# Non-Null Count: 해당 열의 NaN(결측치) 개수 / 그러나 위 데이터에서 보이듯 ?와 같이 결측치가 항상 NaN이 아닌 경우가 있으므로 주의해야 한다.
# Dtype: 각 열의 값의 타입(정수, 실수, 객체(문자열, 복합형))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

In [6]:
titanic_dataFrame.head()
# DataFrame 이름.head()는 DataFrame의 앞 부분 행을 확인하는 기능을 수행한다.

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,?,C,?,328,?
1305,3,0,"Zabour, Miss. Thamine",female,?,1,0,2665,14.4542,?,C,?,?,?
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,?,C,?,304,?
1307,3,0,"Zakarian, Mr. Ortin",male,27,0,0,2670,7.225,?,C,?,?,?
1308,3,0,"Zimmerman, Mr. Leo",male,29,0,0,315082,7.875,?,S,?,?,?

In [7]:
titanic_dataFrame.tail()
# DataFrame 이름.tail()은 DataFrame의 뒷 부분 행을 확인하는 기능을 수행한다.

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,?,C,?,328,?
1305,3,0,"Zabour, Miss. Thamine",female,?,1,0,2665,14.4542,?,C,?,?,?
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,?,C,?,304,?
1307,3,0,"Zakarian, Mr. Ortin",male,27,0,0,2670,7.225,?,C,?,?,?
1308,3,0,"Zimmerman, Mr. Leo",male,29,0,0,315082,7.875,?,S,?,?,?

In [8]:
len(titanic_dataFrame)
# len(DataFrame 이름)은 DataFrame의 행 개수를 알려준다.

1309